"""
3. 

Дан список, содержащий искажённые данные с должностями и именами сотрудников:
['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
Известно, что имя сотрудника всегда в конце строки. Сформировать и вывести на экран фразы вида: 'Привет, Игорь!' Подумать, как получить имена сотрудников из элементов списка, как привести их к корректному виду. Можно ли при этом не создавать новый список?
"""

# Новый список lst не создавался
lst = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']

phrase = 'Привет, {name}!'

for employee in lst:
    # Преобразуем строку в список, первую букву имени преобразуем в верхний регистр и выводим.
    print(
        phrase.format(name = employee.split(' ')[-1].capitalize())
    )
